{
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "dtype": "float32",
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Achaemenid architecture",
    "1": "American Foursquare architecture",
    "2": "American craftsman style",
    "3": "Ancient Egyptian architecture",
    "4": "Art Deco architecture",
    "5": "Art Nouveau architecture",
    "6": "Baroque architecture",
    "7": "Bauhaus architecture",
    "8": "Beaux-Arts architecture",
    "9": "Byzantine architecture",
    "10": "Chicago school architecture",
    "11": "Colonial architecture",
    "12": "Deconstructivism",
    "13": "Edwardian architecture",
    "14": "Georgian architecture",
    "15": "Gothic architecture",
    "16": "Greek Revival architecture",
    "17": "International style",
    "18": "Novelty architecture",
    "19": "Palladian architecture",
    "20": "Postmodern architecture",
    "21": "Romanesque architecture",
    "22": "Russian Revival architecture",
    "23": "Tudor Revival architecture"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Achaemenid architecture": 0,
    "American Foursquare architecture": 1,
    "American craftsman style": 2,
    "Ancient Egyptian architecture": 3,
    "Art Deco architecture": 4,
    "Art Nouveau architecture": 5,
    "Baroque architecture": 6,
    "Bauhaus architecture": 7,
    "Beaux-Arts architecture": 8,
    "Byzantine architecture": 9,
    "Chicago school architecture": 10,
    "Colonial architecture": 11,
    "Deconstructivism": 12,
    "Edwardian architecture": 13,
    "Georgian architecture": 14,
    "Gothic architecture": 15,
    "Greek Revival architecture": 16,
    "International style": 17,
    "Novelty architecture": 18,
    "Palladian architecture": 19,
    "Postmodern architecture": 20,
    "Romanesque architecture": 21,
    "Russian Revival architecture": 22,
    "Tudor Revival architecture": 23
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "pooler_act": "tanh",
  "pooler_output_size": 768,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "transformers_version": "4.57.2"
}
